docs/VPN-config.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-01 Sat 17:45 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>VPN Configuration to Bypass Some Firewalls.</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/styles.css" /> <link rel="stylesheet" type="text/css" href="/css/htmlize.css" /></head>
<body>
<div id="preamble" class="status">
<nav class="nav"> <a href="/index.html" class="button">Home</a> <a href="/sitemap.html" class="button">Sitemaps</a> </nav> <hr>
</div>
<div id="content" class="content">
<h1 class="title">VPN Configuration to Bypass Some Firewalls.</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e8df1d">1. Client Side Configuration</a>
<ul>
<li><a href="#org8e71817">1.1. METHOD 1: With Trojan</a>
<ul>
<li><a href="#orgbd27e4d">1.1.1. <code>trojan</code></a></li>
<li><a href="#org1806f50">1.1.2. <code>systemctl</code></a></li>
<li><a href="#orgcdaffab">1.1.3. <code>proxychains</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SudoRequired">SudoRequired</span></span></a></li>
<li><a href="#orga1a1735">1.1.4. Test the Configuration</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This article collects all contents/situations I faced to configure the commandline environment for the whole visiting without limitations. 
</p>

<div id="outline-container-org0e8df1d" class="outline-2">
<h2 id="org0e8df1d"><span class="section-number-2">1.</span> Client Side Configuration</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8e71817" class="outline-3">
<h3 id="org8e71817"><span class="section-number-3">1.1.</span> METHOD 1: With Trojan</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgbd27e4d" class="outline-4">
<h4 id="orgbd27e4d"><span class="section-number-4">1.1.1.</span> <code>trojan</code></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Trojan is a method to bypass XXX. It can be used and configured very easily.
</p>


<p>
Step 1: install trojan.
</p>


<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c991e1;">cd</span> path-to-install
wget https://github.com/trojan-gfw/trojan/releases/download/v1.16.0/trojan-1.16.0-linux-amd64.tar.xz
tarxvf tar xvf trojan-1.16.0-linux-amd64.tar.xz
</pre>
</div>

<p>
The above commands download the uncompress the binary executable file of <code>trojan</code>. You can also find other releases in <code>https://github.com/trojan-gfw/trojan/releases/</code>.
</p>

<p>
Step 2: configure the Vpn file.
</p>

<p>
Simply copy the configuration (with a <code>json</code> format) text into a place, such as the <code>path-to-install/trojan/config.json</code>. This configuration file contains the info of the server machine, such as:
</p>


<div class="org-src-container">
<pre class="src src-js">
<span style="color: #c66; font-weight: bold;">{</span>
    <span style="color: #ffe9aa;">"run_type"</span>:<span style="color: #ffe9aa;">"client"</span>,
    <span style="color: #ffe9aa;">"local_addr"</span>:<span style="color: #ffe9aa;">"127.0.0.1"</span>,
    <span style="color: #ffe9aa;">"local_port"</span>:1080,
    <span style="color: #ffe9aa;">"remote_addr"</span>:<span style="color: #ffe9aa;">"xxxxxxxxxxxxxxx.com"</span>,
    <span style="color: #ffe9aa;">"remote_port"</span>:443,
    <span style="color: #ffe9aa;">"password"</span>:<span style="color: #6c6; font-weight: bold;">[</span><span style="color: #ffe9aa;">"xxxxxxxxxxxxxxxxxxxxxxxxxx"</span><span style="color: #6c6; font-weight: bold;">]</span>,
    <span style="color: #ffe9aa;">"log_level"</span>:1,
    <span style="color: #ffe9aa;">"ssl"</span>:
    <span style="color: #6c6; font-weight: bold;">{</span>
        <span style="color: #ffe9aa;">"verify"</span>:<span style="color: #aaffe4;">true</span>,
        <span style="color: #ffe9aa;">"verify_hostname"</span>:<span style="color: #aaffe4;">true</span>,
        <span style="color: #ffe9aa;">"cert"</span>:<span style="color: #ffe9aa;">""</span>,
        <span style="color: #ffe9aa;">"cipher"</span>:<span style="color: #ffe9aa;">"ECDHE-ECDSA-xxxxxxxxxxxxxxxxxxxxxxxxxx"</span>,
        <span style="color: #ffe9aa;">"cipher_tls13"</span>:<span style="color: #ffe9aa;">"TLS_AES_xxxxxxxxxxxxxxxxxxxxxxxx"</span>,
        <span style="color: #ffe9aa;">"sni"</span>:<span style="color: #ffe9aa;">""</span>,
        <span style="color: #ffe9aa;">"alpn"</span>:<span style="color: #69f; font-weight: bold;">[</span><span style="color: #ffe9aa;">"h2"</span>,<span style="color: #ffe9aa;">"http/1.1"</span><span style="color: #69f; font-weight: bold;">]</span>,
        <span style="color: #ffe9aa;">"reuse_session"</span>:<span style="color: #aaffe4;">true</span>,
        <span style="color: #ffe9aa;">"session_ticket"</span>:<span style="color: #aaffe4;">false</span>,
        <span style="color: #ffe9aa;">"curves"</span>:<span style="color: #ffe9aa;">""</span>
    <span style="color: #6c6; font-weight: bold;">}</span>,
    <span style="color: #ffe9aa;">"tcp"</span>:
    <span style="color: #6c6; font-weight: bold;">{</span>
        <span style="color: #ffe9aa;">"no_delay"</span>:<span style="color: #aaffe4;">true</span>,
        <span style="color: #ffe9aa;">"keep_alive"</span>:<span style="color: #aaffe4;">true</span>,
        <span style="color: #ffe9aa;">"reuse_port"</span>:<span style="color: #aaffe4;">false</span>,
        <span style="color: #ffe9aa;">"fast_open"</span>:<span style="color: #aaffe4;">false</span>,
        <span style="color: #ffe9aa;">"fast_open_qlen"</span>:20
    <span style="color: #6c6; font-weight: bold;">}</span>
<span style="color: #c66; font-weight: bold;">}</span>
</pre>
</div>

<p>
Then step 2 ends.
</p>

<p>
You can now use it via <code>/home/pathtoinstall/trojan/trojan -c /home/pathtocofnig/config.json -l /home/pathtolog/trojan.log</code>.
</p>


<p>
Step 3: Configure the auto-start
</p>

<p>
There exist some convenient tools for a command-line VPN configuration.
</p>
</div>
</div>

<div id="outline-container-org1806f50" class="outline-4">
<h4 id="org1806f50"><span class="section-number-4">1.1.2.</span> <code>systemctl</code></h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
It allows the machine automatically start a service when necessary.
</p>

<p>
First, Create a file for the configuration:
</p>

<div class="org-src-container">
<pre class="src src-sh">vim ~/.config/systemd/user/trojan.service
</pre>
</div>

<p>
Then insert the following contents:
</p>


<div class="org-src-container">
<pre class="src src-service">[Unit]
Description=trojan
After=network.target

[Service]
Type=simple
PIDFile=/home/path-to-install/trojan/trojan.pid
ExecStart=/home/pathtoinstall/trojan/trojan -c /home/pathtoconfig/trojan/config.json -l /home/pathtolog/trojan/trojan.log
ExecReload=/bin/kill -HUP \$MAINPID
Restart=on-failure
RestartSec=1s

[Install]
WantedBy=multi-user.target
</pre>
</div>

<p>
Now you are ready to start the services by <code>systemctl --user start trojan</code>.
</p>

<p>
You can also check the status of your service by <code>systemctl --user status trojan.service</code>.
</p>
</div>
</div>


<div id="outline-container-orgcdaffab" class="outline-4">
<h4 id="orgcdaffab"><span class="section-number-4">1.1.3.</span> <code>proxychains</code>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="SudoRequired">SudoRequired</span></span></h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<code>proxychains</code> is a useful tool to use the trojan.
</p>

<p>
First, install it: <code>sudo apt install proxychains</code>.
</p>

<p>
Second, configure it by edit its configuration file:
<code>sudo vim /etc/proxychains.conf</code>
</p>

<p>
Comment the line of "socks4  xxxxxxxx xxxx", and add a new line :
</p>


<div class="org-src-container">
<pre class="src src-conf">socks5 127.0.0.1 1080
</pre>
</div>

<p>
where the port is the port you set in your <code>config.json</code> in the trojan.
</p>

<p>
Now you can use it via: <code>proxychains command-yours XXXXXXXXXX</code>.
</p>
</div>
</div>



<div id="outline-container-orga1a1735" class="outline-4">
<h4 id="orga1a1735"><span class="section-number-4">1.1.4.</span> Test the Configuration</h4>
<div class="outline-text-4" id="text-1-1-4">
<div class="org-src-container">
<pre class="src src-sh">
<span style="color: #565575;"># </span><span style="color: #96a0aa;">1. test the configuration of trojan:</span>
curl ip.sb --socks5 127.0.0.1 1080

<span style="color: #565575;"># </span><span style="color: #96a0aa;">2. test the configuration of systemctl</span>

systemctl --user status trojan.service

<span style="color: #565575;"># </span><span style="color: #96a0aa;">3. test the configuration of proxychains</span>
curl -4 ip.sb
proxychains curl -4 ip.sb

</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr class="Solid"> <div class="info"> <span class="author">Author: Zi Liang (<a href="mailto:zi1415926.liang@connect.polyu.hk">zi1415926.liang@connect.polyu.hk</a>)</span> <span class="date">Create Date: Tue Oct 29 20:05:13 2024</span> <span class="date">Last modified: 2025-02-01 Sat 17:21</span> <span>Creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span> </div>
</div>
</body>
</html>
